giovadifiore/iot-home-automation/Client/src/helpers/include/stm32f4xx_helper_lis3dsh.h
/**
 ******************************************************************************
 * @file    stm32f4_discovery_lis3dsh.h
 * @author  Giovanni Di Fiore - SE4
 * @version V1.0
 * @date    04-April-2015
 * @brief   LIS3DSH Accelerator library (Header)
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; COPYRIGHT(c) 2014 STMicroelectronics</center></h2>
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of STMicroelectronics nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32F4_DISCOVERY_LIS3DSH_H_
#define STM32F4_DISCOVERY_LIS3DSH_H_

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

//-------------------------- LIS3DSH register defines ------------------------------------------

/* Register INFO1 -------------- Information register 1 --------------------------------------------
 *	Default value: (uint8_t)0x21
 *	Read only register
 */
#define LIS3DSH_INFO1_ADDR				(uint8_t)0x0d

/* Register INFO2 -------------- Information register 2 --------------------------------------------
 *	Default value: (uint8_t)0x00
 *	Read only register
 */
#define LIS3DSH_INFO2_ADDR				(uint8_t)0x0e

/* Register WHO_AM_I ----------- Who I am ID -------------------------------------------------------
 *	Default value: (uint8_t)0x3f
 *	Read only register
 */
#define LIS3DSH_WHO_AM_I_ADDR				(uint8_t)0x0f
#define _I_AM_LIS3DSH						(uint8_t)0x3f

/* Register CTRL_REG3 ---------- Control Register 3 ------------------------------------------------
 *	Default value: ---
 *	Read/Write register
 *
 *		bit:
 *			7:DR_EN		DRDY signal enable to INT1
 *				Default value:0
 *				0 = data ready signal not connected
 *				1 = data ready signal connected to INT1
 *			6:IEA		Interrupt signal polarity
 *				Default value:0
 *				0 = interrupt signals active LOW
 *				1 = interrupt signals active HIGH
 *			5:IEL		Interrupt signal latching
 *				Default value:0
 *				0 = interrupt signals latched
 *				1 = interrupt signal pulsed
 *			4:INT2_EN	Interrupt 2 enable/disable
 *				Default value:0
 *				0 = INT2 signal disabled
 *				1 = INT2 signal enabled
 * 			3:INT1_EN	Interrupt 1 enable/disable
 * 				Default Value:0
 * 				0 = INT1/DRDY signal disabled
 * 				1 = INT1/DRDY signal enabled
 * 			2:VFILT		Vector filter enable/disable
 * 				Default value:0
 * 				0 = vector filter disabled
 * 				1 = vector filter enabled
 * 			1:---
 * 			0:STRT		Soft reset bit
 * 				0 = no soft reset
 * 				1 = soft reset (POR function)
 */
#define LIS3DSH_CTRL_REG3_ADDR				(uint8_t)0x23
#define _LIS3DSH_DR_EN			7
#define _LIS3DSH_IEA			6
#define _LIS3DSH_IEL			5
#define _LIS3DSH_INT2_EN		4
#define _LIS3DSH_INT1_EN		3
#define _LIS3DSH_VFILT			2
#define _LIS3DSH_STRT			0

/*	Register CTRL_REG4 --------- Control Register 4 ------------------------------------------------
 *	Default value: ---
 *	Read/Write register
 *
 *		bit:
 *			7:ODR3		ODR[3:0]	Output data rate and power mode selection
 *			6:ODR2
 *			5:ODR1
 *			4:ODR0
 *				Default value:0000
 *				ODR3	ODR2	ODR1	ODR0	ODR-selection
 *				 0		 0		 0		 0		power down
 *				 0		 0		 0		 1		3.125Hz
 *				 0		 0		 1		 0		6.25Hz
 *				 0		 0		 1		 1		12.5Hz
 *				 0		 1		 0		 0		25Hz
 *				 0		 1		 0		 1		50Hz
 *				 0		 1		 1		 0		100Hz
 *				 0		 1		 1		 1		400Hz
 *				 1		 0		 0		 0		800Hz
 *				 1		 0		 0		 1		1600Hz
 *			3:BDU		Block data update
 *				Default value:0
 *				0:continuos update
 *				1:output registers not updated (until MSB and LSB reading)
 *			2:ZEN		Z axis enable
 *				Default value:1
 *				0:Z axis disabled
 *				1:Z axis enabled
 *			1:YEN		Y axis enable
 *				Default value:1
 *				0:Y axis disabled
 *				1:Y axis enabled
 *			0:XEN		X axis enable
 *				Default value:1
 *				0=X axis disabled
 *				1=X axis enabled
 *
 */
#define LIS3DSH_CTRL_REG4_ADDR				(uint8_t)0x20
#define _LIS3DSH_ODR3					7
#define _LIS3DSH_ODR2					6
#define _LIS3DSH_ODR1					5
#define _LIS3DSH_ODR0					4
#define _LIS3DSH_BDU					3
#define _LIS3DSH_Z_ENABLE				2
#define _LIS3DSH_YENABLE				1
#define _LIS3DSH_XENABLE				0
#define LIS3DSH_ODR_POWER_DOWN			((uint8_t)0b00000000)
#define LIS3DSH_ODR_3_125_HZ			((uint8_t)0b00010000)
#define LIS3DSH_ODR_6_25_HZ				((uint8_t)0b00100000)
#define LIS3DSH_ODR_12_5_HZ				((uint8_t)0b00110000)
#define LIS3DSH_ODR_25_HZ				((uint8_t)0b01000000)
#define LIS3DSH_ODR_50_HZ				((uint8_t)0b01010000)
#define LIS3DSH_ODR_100_HZ				((uint8_t)0b01100000)
#define LIS3DSH_ODR_400_HZ				((uint8_t)0b01110000)
#define LIS3DSH_ODR_800_HZ				((uint8_t)0b10000000)
#define LIS3DSH_ODR_1600_HZ				((uint8_t)0b10010000)
#define LIS3DSH_XYZ_ENABLE				((uint8_t)0b00000111)
#define LIS3DSH_BDU_CONTINOUS_UPDATE	((uint8_t)0b00000000)
#define LIS3DSH_BDU_NOT_UPDATET			((uint8_t)0b00001000)
/* Register CTRL_REG5 ---------- Control Register 5 ------------------------------------------------
 *	Default value: ---
 *	Read/Write register
 *
 *		bit:
 *			7:BW2		Anti-aliasing filter bandwidth
 *			6:BW1
 *				Default value: 00
 *				BW2		BW1		BW-selection
 *				 0		 0			800 Hz
 *				 0		 1			400 Hz
 *				 1		 0			200 Hz
 *				 1		 1			50 Hz
 *			5:FSCALE2	Full-scale selection
 *			4:FSCALE1
 *			3:FSCALE0
 *				Default value: 000
 *				FSCALE2	FSCALE1	FSCALE0 FSCALE-selection
 *					0		0		0		+/- 2G
 *					0		0		1		+/- 4G
 *					0		1		0		+/- 6G
 *					0		1		1		+/- 8G
 *					1		0		0		+/- 16G
 *
 *			2:ST2		Self-test enable
 *			1:ST1
 *				Default value: 00
 *				ST2		ST1		self-test mode
 *				 0		 0		self-test disabled
 *				 0		 1		Positive sign self-test
 *				 1		 0		Negative sign self-test
 *				 1		 1		Not allowed
 *			0:SIM		SPI serial interface mode selection
 *				Default value: 0
 *				0:	4-wire interface
 *				1:	3-wire interface
 *
 */
#define LIS3DSH_CTRL_REG5_ADDR				(uint8_t)0x24
#define LIS3DSH_FS_2G						((uint8_t)0b00000000)
#define LIS3DSH_FS_4G						((uint8_t)0b00001000)
#define LIS3DSH_FS_6G						((uint8_t)0b00010000)
#define LIS3DSH_FS_8G						((uint8_t)0b00110000)
#define LIS3DSH_FS_16G						((uint8_t)0b00100000)
#define _LIS3DSH_BW2						7
#define _LIS3DSH_BW1						6
#define _LIS3DSH_FSCALE2					5
#define _LIS3DSH_FSCALE1					4
#define _LIS3DSH_FSCALE0					3
#define _LIS3DSH_ST2						2
#define _LIS3DSH_ST1						1
#define _LIS3DSH_SIM						0

