giovadifiore/iot-home-automation/Client/src/helpers/include/stm32f4xx_helper_lis3dsh.h
/* Register CTRL_REG6 ---------- Control Register 6 ------------------------------------------------
 *	Default value: ---
 *	Read/Write register
 *
 *		bit:
 *			7:BOOT			Force reboot, cleared as soon as the reboot is finished
 *				Active: 1
 *			6:FIFO_EN		FIFO enable
 *				Default value 0
 *				0:disable
 *				1:enable
 *			5:WTM_EN		Enable FIFO Watermark level use
 *				Default value: 0
 *				0:disable
 *				1:enable
 *			4:ADD_INC		Register address automatically incremented during a multiple byte access
 *							with a serial interface (I2C or SPI)
 *				0:disable
 *				1:enable
 *			3:P1_EMPTY		Enable FIFO Empty indication on int1
 *				Default value 0
 *				0:disable
 *				1:enable
 *			2:P1_WTM		FIFO Watermark interrupt on int1
 *				Default value 0
 *				0:disable
 *				1:enable
 *			1:P1_OVER_RUN	FIFO overrun interrupt on int1
 *				Default value 0
 *				0:disable
 *				1:enable
 *			0:P2_BOOT		BOOT interrupt on int2
 *				Default value 0
 *				0:disable
 *				1:enable
 */
#define LIS3DSH_CTRL_REG6_ADDR				(uint8_t)0x25
#define _LIS3DSH_BOOT			7
#define _LIS3DSH_FIFO_EN		6
#define _LIS3DSH_WTM_EN			5
#define _LIS3DSH_ADD_INC		4
#define _LIS3DSH_P1_EMPTY		3
#define _LIS3DSH_P1_WTM			2
#define _LIS3DSH_P1_OVER_RUN	1
#define _LIS3DSH_P2_BOOT		0

/*	Register STATUS ------------- Status Data Register ---------------------------------------------
 *	Default value: ---
 *	Read only register
 *
 *		bit:
 *			7:ZYXOR		X, Y, and Z axis data overrun
 *				Default value: 0
 *				0: no overrun has occurred
 *				1: a new set of data has overwritten the previous ones
 *			6:ZOR		Z axis data overrun
 *				Default value: 0
 *				0: no overrun has occurred
 *				1: a new data for the Z-axis has overwritten the previous one
 *			5:YOR		Y axis data overrun
 *				Default value: 0
 *				0: no overrun has occurred
 *				1: a new data for the Y-axis has overwritten the previous one
 *			4:XOR		X axis data overrun
 *				Default value: 0
 *				0: no overrun has occurred
 *				1: a new data for the X-axis has overwritten the previous one
 *			3:ZYXDA		X, Y, and Z axis new data available
 *				Default value: 0
 *				0: a new set of data is not yet available
 *				1: a new set of data is available
 *			2:ZDA		Z axis new data available
 *				Default value: 0
 *				0: a new data for the Z-axis is not yet available
 *				1: a new data for the Z-axis is available
 *			1:YDA		Y axis new data available
 *				Default value: 0
 *				0: a new data for the Y-axis is not yet available
 *				1: a new data for the Y-axis is available
 *			0:XDA		X axis new data available
 *				Default value: 0
 *				0: a new data for the X-axis is not yet available
 *				1: a new data for the X-axis is available
 */
#define LIS3DSH_STATUS_ADDR					(uint8_t)0x27
#define _LIS3DSH_ZYXOR			7
#define _LIS3DSH_ZOR			6
#define _LIS3DSH_YOR			5
#define _LIS3DSH_XOR			4
#define _LIS3DSH_ZYXDA			3
#define _LIS3DSH_ZDA			2
#define _LIS3DSH_YDA			1
#define _LIS3DSH_XDA			0

/*	Register OUT_T ------------- Temperature Output ------------------------------------------------
 *	Default value: ---
 *	Read only register
 *
 *	Temperature output register.
 *	Temperature data (1LSB/deg - 8-bit resolution).
 *	The value is expressed as two's complement.
 *
 */
#define LIS3DSH_OUT_T_ADDR					(uint8_t)0x0c

/*	Register OFFSET_X ---------- X-axis offset correction ------------------------------------------
 *	Default value: 0
 *	Read/Write register
 *
 *	Offset correction X-axis register,signed value.
 */
#define LIS3DSH_OFFSET_X_ADDR				(uint8_t)0x10

/*	Register OFFSET_Y ---------- Y-axis offset correction ------------------------------------------
 *	Default value: 0
 *	 Read Write register
 *
 *	 Offset correction Y-axis register, signed value.
 */
#define LIS3DSH_OFFSET_Y_ADDR				(uint8_t)0x11

/*	Register OFFSET_Z ---------- Z-axis offset correction ------------------------------------------
 *	Default value: 0
 *	Read/Write register
 *
 *	Offset correction Z-axis register, signed value.
 */
#define LIS3DSH_OFFSET_Z_ADDR				(uint8_t)0x12

/*	Register CS_X -------------- Constant shift X --------------------------------------------------
 *	Default value: 0
 *	Read/Write register
 *
 *	Constant shift signed value X-axis register - state machine only.
 */
#define LIS3DSH_CS_X_ADDR					(uint8_t)0x13

/*	Register CS_Y -------------- Constant shift Y --------------------------------------------------
 *	Default value: 0
 *	Read/Write register
 *
 *	Constant shift signed value Y-axis register - state machine only
 */
#define LIS3DSH_CS_Y_ADDR					(uint8_t)0x14

/*	Register CS_Z -------------- Constant shift Z --------------------------------------------------
 *	Default value: 0
 *	Read/Write register
 *
 *	Constant shift signed value Y-axis register - state machine only.
 */
#define LIS3DSH_CS_Z_ADDR					(uint8_t)0x15

/*	Register LC ---------------- Long counter registers --------------------------------------------
 *	Default value: 1
 *	Read/Write register
 *
 *	16-bit long-counter register for interrupt state machine programs timing.
 *	01h=counting stopped, 00h=counter full: interrupt available and counter is set to default.
 *	Values higher than 00h:counting
 */
#define LIS3DSH_LC_H_ADDR					(uint8_t)0x16
#define LIS3DSH_LC_L_ADDR					(uint8_t)0x17

/*	Register STAT -------------- Interrupt status - interrupt synchronization register -------------
 *	Default value: ---
 *	Read only register
 *
 *		bit:
 *			7:LONG		interrupt flag common for both SM
 *				0: no interrupt
 *				1: long counter (LC)
 *			6:SYNCW		Synchronization for external Host Controller interrupt based on output data
 *				0: no action waiting from host
 *				1: action from host based on output data
 *			5:SYNC1
 *				0: SM1 running normally
 *				1: SM1 stopped and await restart request from SM2
 *			4:SYNC2
 *				0: SM2 running normally
 *				1: SM2 stopped and await restart request from SM1
 *			3:INT_SM1	SM1 - Interrupt Selection
 *				0: SM1 interrupt disable
 *				1: SM1 interrupt enable
 *			2:INT_SM2	SM2 - Interrupt Selection
 *				0: SM2 interrupt disable
 *				1: SM2 interrupt enable
 *			1:DOR		Data overrun indicates not read data from output register when
 *						next data samples measure start
 *				0: no overrun
 *				1: data overrun data overrun bit is reset when next
 sample is ready
 *			0:DRDY
 */
#define LIS3DSH_STAT_ADDR					(uint8_t)0x18
#define _LIS3DSH_LONG			7
#define _LIS3DSH_SYNCW			6
#define _LIS3DSH_SYNC1			5
#define _LIS3DSH_SYNC2			4
#define _LIS3DSH_INT_SM1		3
#define _LIS3DSH_INT_SM2		2
#define _LIS3DSH_DOR			1
#define _LIS3DSH_DRDY			0

/*	Register VFC_1 ------------- Vector filter coefficient 1 ---------------------------------------
 *	Default value: 0
 *	Read/Write register
 *
 *	Vector coefficient register 1 for DIff filter.
 */
#define LIS3DSH_VFC_1_ADDR					(uint8_t)0x1b

/*	Register VFC_2 ------------- Vector filter coefficient 2 ---------------------------------------
 *	Default value: 0
 *	Read/Write register
 *
 *	Vector coefficient register 2 for DIff filter.
 */
#define LIS3DSH_VFC_2_ADDR					(uint8_t)0x1c

