giovadifiore/iot-home-automation/Client/src/helpers/include/stm32f4xx_helper_lis3dsh.h
/*	Register VFC_3 ------------- Vector filter coefficient 3 ---------------------------------------
 *	Default value: 0
 *	Read/Write register
 *
 *	Vector coefficient register 3 for FSM2 filter.
 */
#define LIS3DSH_VFC_3_ADDR					(uint8_t)0x1d

/*	Register VFC_4 ------------- Vector filter coefficient 4 ---------------------------------------
 *	Default value: 0
 *	Read/Write register
 *
 *	Vector coefficient register 4 for DIff filter.
 */
#define LIS3DSH_VFC_4_ADDR					(uint8_t)0x1e

/*	Register THRS3 ------------ Threshold value 3 --------------------------------------------------
 *	Default value: 0
 *	Read/Write register
 *
 *	Threshold value register.
 */
#define LIS3DSH_THRS3_ADDR					(uint8_t)0x1f

/*	Register OUT_X ------------ Output register X --------------------------------------------------
 *	Default value: 0
 *	Read only register
 *
 *	X-axis output register.
 */
#define LIS3DSH_OUT_X_L_ADDR				(uint8_t)0x28
#define LIS3DSH_OUT_X_H_ADDR				(uint8_t)0x29

/*	Register OUT_Y ------------ Output register Y --------------------------------------------------
 *	Default value: 0
 *	Read only register
 *
 *	Y-axis output register.
 */
#define LIS3DSH_OUT_Y_L_ADDR				(uint8_t)0x2a
#define LIS3DSH_OUT_Y_H_ADDR				(uint8_t)0x2b

/*	Register OUT_Z ------------ Output register Z --------------------------------------------------
 *	Default value: 0
 *	Read only register
 *
 *	Z-axis output register.
 */
#define LIS3DSH_OUT_Z_L_ADDR				(uint8_t)0x2c
#define LIS3DSH_OUT_Z_H_ADDR				(uint8_t)0x2d

/*	Register FIFO_CTRL -------- FIFO control register ----------------------------------------------
 *	Default value: ---
 *	Read/write register
 *
 *		bit:
 *			7:FMODE2	FMODE[2:0] FIFO Mode Selection.
 *			6:FMODE1
 *			5:FMODE0
 *				FMODE2	FMODE1	FMODE0	MODE
 *					0		0		0	Bypass Mode. FIFO turned off
 *					0		0		1	FIFO Mode. Stop collecting data when FIFO is full.
 *					0		1		0	Stream Mode. If the FIFO is full the new sample
 *										overwrites the older one
 *					0		1		1	Stream mode until trigger is deasserted, then FIFO mode
 *					1		0		0	Bypass mode until trigger is deasserted, then Stream mode
 *					1		0		1	Not Used.
 *					1		1		0	Not Used.
 *					1		1		1	Bypass mode until trigger is deasserted, then FIFO mode
 *			4:WTMP4		WTMP[4:0] - FIFO Watermark pointer; FIFO deep if the Watermark is enabled.
 *			3:WTMP3
 *			2:WTMP2
 *			1:WTMP1
 *			0:WTMP0
 */
#define LIS3DSH_FIFO_CTRL_ADDR				(uint8_t)0x2e
#define _LIS3DSH_FMODE2		7
#define _LIS3DSH_FMODE1		6
#define _LIS3DSH_FMODE0		5
#define _LIS3DSH_WTMP4		4
#define _LIS3DSH_WTMP3		3
#define _LIS3DSH_WTMP2		2
#define _LIS3DSH_WTMP1		1
#define _LIS3DSH_WTMP0		0

/*	Register FIFO_SRC --------- FIFO SRC control register ------------------------------------------
 *	Default value: ---
 *	Read only register
 *
 *		bit:
 *			7:WTM		Watermark status.
 *				0: FIFO filling is lower than WTM level
 *				1: FIFO filling is equal or higher than WTM level
 *			6:OVRN FIFO	Overrun bit status
 *				0: FIFO is not completely filled
 *				1: FIFO is completely filled
 *			5:EMPTY		FIFO empty bit
 *				0: FIFO not empty
 *				1: FIFO empty)
 *			4:FSS4		FSS[4:0] FIFO stored data level
 *			3:FSS3
 *			2:FSS2
 *			1:FSS1
 *			0:FSS0
 */
#define LIS3DSH_FIFO_SRC_ADDR				(uint8_t)0x2f
#define _LIS3DSH_WTM		7
#define _LIS3DSH_OVRN		6
#define _LIS3DSH_EMPTY		5
#define _LIS3DSH_FSS4		4
#define _LIS3DSH_FSS3		3
#define _LIS3DSH_FSS2		2
#define _LIS3DSH_FSS1		1
#define _LIS3DSH_FSS0		0

/*	Register CTRL_REG1 -------- SM1 control register -----------------------------------------------
 *	Default value: 0
 *	Read/write register
 *
 *		bit:
 *			7:HYST2_1		Hysteresis unsigned value to be added
 *							or subtracted from threshold value in SM1
 *			6:HYST1_1
 *			5:HYST0_1
 *				Default value: 000
 *			4: -
 *			3:SM1_PIN
 *				Default value:0
 *				0: SM1 interrupt routed to INT1
 *				1: SM1 interrupt routed to INT2 pin
 *			2: -
 *			1: -
 *			0:SM1_EN
 *				Default value: 0
 *				0: SM1 disabled
 *				1: SM1 enabled
 */
#define LIS3DSH_CTRL_REG1_ADDR				(uint8_t)0x21
#define _LIS3DSH_HYST2_1		7
#define _LIS3DSH_HYST1_1		6
#define _LIS3DSH_HYST0_1		5
#define _LIS3DSH_SM1_PIN		3
#define _LIS3DSH_SM1_EN			0

/*	Registers ST1_1-ST1_16 ---- SM1 code registers [1-16] ------------------------------------------
 *	Default value: ---
 *	Write only registers
 *
 *	State machine 1 system register is made up of 16, 8- bit registers
 *	to implement 16-step op-code.
 */
#define LIS3DSH_ST1_1_ADDR					(uint8_t)0x40
#define LIS3DSH_ST1_2_ADDR					(uint8_t)0x41
#define LIS3DSH_ST1_3_ADDR					(uint8_t)0x42
#define LIS3DSH_ST1_4_ADDR					(uint8_t)0x43
#define LIS3DSH_ST1_5_ADDR					(uint8_t)0x44
#define LIS3DSH_ST1_6_ADDR					(uint8_t)0x45
#define LIS3DSH_ST1_7_ADDR					(uint8_t)0x46
#define LIS3DSH_ST1_8_ADDR					(uint8_t)0x47
#define LIS3DSH_ST1_9_ADDR					(uint8_t)0x48
#define LIS3DSH_ST1_10_ADDR					(uint8_t)0x49
#define LIS3DSH_ST1_11_ADDR					(uint8_t)0x4a
#define LIS3DSH_ST1_12_ADDR					(uint8_t)0x4b
#define LIS3DSH_ST1_13_ADDR					(uint8_t)0x4c
#define LIS3DSH_ST1_14_ADDR					(uint8_t)0x4d
#define LIS3DSH_ST1_15_ADDR					(uint8_t)0x4e
#define LIS3DSH_ST1_16_ADDR					(uint8_t)0x4f

/*	Register TIM4_1 ----------- SM1 general timer --------------------------------------------------
 *	Default value: ---
 *	Write only register
 *
 *	8-bit general timer (unsigned value) for SM1 operation timing.
 */
#define LIS3DSH_TIM4_1_ADDR					(uint8_t)0x50

/*	Register TIM3_1 ----------- SM1 general timer --------------------------------------------------
 *	Default value: ---
 *	Write only register
 *
 *	8-bit general timer (unsigned value) for SM1 operation timing.
 */
#define LIS3DSH_TIM3_1_ADDR					(uint8_t)0x51

/*	Register TIM2_1 ----------- SM1 general timer --------------------------------------------------
 *	Default value: ---
 *	Write only register
 *
 *	16-bit general timer (unsigned value) for SM1 operation timing.
 */
#define LIS3DSH_TIM2_1_L_ADDR				(uint8_t)0x52
#define LIS3DSH_TIM2_1_H_ADDR				(uint8_t)0x53

/*Register TIM1_1 ------------- SM1 general timer --------------------------------------------------
 *	Default value: ---
 *	Write only register
 *
 *	16-bit general timer (unsigned value) for SM1 operation timing.
 */
#define LIS3DSH_TIM1_1_L_ADDR				(uint8_t)0x54
#define LIS3DSH_TIM1_1_H_ADDR				(uint8_t)0x55

