giovadifiore/iot-home-automation/Client/src/helpers/include/stm32f4xx_helper_lis3dsh.h
/*	Register THRS2_1 ---------- SM1 threshold value 1 ----------------------------------------------
 *	Default value: ---
 *	Write only register
 *
 *	Threshold value for SM1 operation.
 */
#define LIS3DSH_THRS2_1_ADDR				(uint8_t)0x56

/*	Register THRS1_1 ---------- SM1 threshold value 2 ----------------------------------------------
 *	Default value: ---
 *	Write only register
 *
 *	Threshold value for SM1 operation.
 */
#define LIS3DSH_THRS1_1_ADDR				(uint8_t)0x57

/*	Register MASK1_B ---------- SM1 axis and sign mask ---------------------------------------------
 *	Default value: ---
 *	Write only register
 *
 *	Axis and sign mask (swap) for SM1 motion detection operation.
 *
 *		bit:
 *			7:P_X
 *				0: X + disabled
 *				1: X + enabled
 *			6:N_X
 *				0: X - disabled
 *				1: X � enabled
 *			5:P_Y
 *				0: X + disabled
 *				1: X + enabled
 *			4:N_Y
 *				0: X - disabled
 *				1: X � enabled
 *			3:P_Z
 *				0: X + disabled
 *				1: X + enabled
 *			2:N_Z
 *				0: X - disabled
 *				1: X � enabled
 *			1:P_V
 *				0: X + disabled
 *				1: X + enabled
 *			0:N_V
 *				0: X - disabled
 *				1: X � enabled
 */
#define LIS3DSH_MASK1_B_ADDR				(uint8_t)0x59
#define _LIS3DSH_P_X		7
#define _LIS3DSH_N_X		6
#define _LIS3DSH_P_Y		5
#define _LIS3DSH_N_Y		4
#define _LIS3DSH_P_Z		3
#define _LIS3DSH_N_Z		2
#define _LIS3DSH_P_V		1
#define _LIS3DSH_N_V		0

/*	Register MASK1_A ---------- SM1 axis and sign mask ---------------------------------------------
 *	Default value: ---
 *	Write only register
 *
 *	Axis and sign mask (default) for SM1 motion detection operation.
 *
 *		bit:
 *			7:P_X
 *				0: X + disabled
 *				1: X + enabled
 *			6:N_X
 *				0: X - disabled
 *				1: X � enabled
 *			5:P_Y
 *				0: X + disabled
 *				1: X + enabled
 *			4:N_Y
 *				0: X - disabled
 *				1: X � enabled
 *			3:P_Z
 *				0: X + disabled
 *				1: X + enabled
 *			2:N_Z
 *				0: X - disabled
 *				1: X � enabled
 *			1:P_V
 *				0: X + disabled
 *				1: X + enabled
 *			0:N_V
 *				0: X - disabled
 *				1: X � enabled
 */
#define LIS3DSH_MASK1_A_ADDR				(uint8_t)0x5a
#define _LIS3DSH_P_X		7
#define _LIS3DSH_N_X		6
#define _LIS3DSH_P_Y		5
#define _LIS3DSH_N_Y		4
#define _LIS3DSH_P_Z		3
#define _LIS3DSH_N_Z		2
#define _LIS3DSH_P_V		1
#define _LIS3DSH_N_V		0

/*	Register SETT1 ------------ SM1 detection settings ---------------------------------------------
 *	Default value: ---
 *	Write only register
 *
 *	Setting of threshold, peak detection and flags for SM1 motion detection operation.
 *
 *		bit:
 *			7:P_DET		SM1 peak detection
 *				Default value:0
 *				0: peak detection disabled
 *				1: peak detection enabled
 *			6:THR3_SA
 *				Default value:0
 *				0: no action
 *				1: threshold 3 limit value for axis and sign mask reset (MASKB_1)
 *			5:ABS
 *				Default value:0
 *				0: unsigned thresholds
 *				1: signed thresholds
 *			4:-
 *			3:-
 *			2:THR3_MA
 *				Default value:0
 *				0: no action
 *				1: threshold 3 limit value for axis and sign mask reset (MASKA_1)
 *			1:R_TAM		Next condition validation flag
 *				Default value:0
 *				0: no valid next condition found
 *				1: valid next condition found and reset
 *			0:SITR
 *				Default value:0
 *				0: no actions
 *				1: program flow can be modified by STOP and CONT commands
 */
#define LIS3DSH_SETT1_ADDR					(uint8_t)0x5b
#define _LIS3DSH_P_DET		7
#define _LIS3DSH_THR3_SA	6
#define _LIS3DSH_ABS		5
#define _LIS3DSH_THR3_MA	2
#define _LIS3DSH_R_TAM		1
#define _LIS3DSH_SITR		0

/*	Register PR1 -------------- Program-reset pointer ----------------------------------------------
 *	Default value: ---
 *	Read only register
 *
 *	Program and reset pointer for SM1 motion detection operation.
 *
 *		bit:
 *			7:PP3		PP[3:0] SM1 program pointer address
 *			6:PP2
 *			5:PP1
 *			4:PP0
 *			3:PR3		PR[3:0] SM1 reset pointer address
 *			2:PR2
 *			1:PR1
 *			0:PR0
 */
#define LIS3DSH_RP1_ADDR					(uint8_t)0x5c
#define _LIS3DSH_PP3		7
#define _LIS3DSH_PP2		6
#define _LIS3DSH_PP1		5
#define _LIS3DSH_PP0		4
#define _LIS3DSH_PR3		3
#define _LIS3DSH_PR2		2
#define _LIS3DSH_PR1		1
#define _LIS3DSH_PR0		0

/*	Register TC1 -------------- Timer counter ------------------------------------------------------
 *	Default value: ---
 *	Read only registers
 *
 *	16-bit general timer (unsigned output value) for SM1 operation timing.
 */
#define LIS3DSH_TC1_L_ADDR					(uint8_t)0x5d
#define LIS3DSH_TC1_H_ADDR					(uint8_t)0x5e

/*	Register OUTS1 ------------ Main set flag ------------------------------------------------------
 *	Default value: ---
 *	Read only register
 *
 *	Output flags on axis for interrupt SM1 management.
 *
 *		bit:
 *			7:P_X
 *				0: X + no show
 *				1: X + show
 *			6:N_X
 *				0: X - no show
 *				1: X - show
 *			5:P_Y
 *				0: X + no show
 *				1: X + show
 *			4:N_Y
 *				0: X - no show
 *				1: X - show
 *			3:P_Z
 *				0: X + no show
 *				1: X + show
 *			2:N_Z
 *				0: X - no show
 *				1: X - show
 *			1:P_V
 *				0: X + no show
 *				1: X + show
 *			0:N_V
 *				0: X - no show
 *				1: X - show
 */
#define LIS3DSH_OUTS1_ADDR					(uint8_t)0x5f
#define _LIS3DSH_P_X		7
#define _LIS3DSH_N_X		6
#define _LIS3DSH_P_Y		5
#define _LIS3DSH_N_Y		4
#define _LIS3DSH_P_Z		3
#define _LIS3DSH_N_Z		2
#define _LIS3DSH_P_V		1
#define _LIS3DSH_N_V		0

/*	Register PEAK1 ------------ Peak value ---------------------------------------------------------
 *	Default value: ---
 *	Read only register
 *
 *	Peak detection value register for SM1 operation.
 */
#define LIS3DSH_PEAK1_ADDR					(uint8_t)0x19

/*	Register CTRL_REG2 -------- SM2 control register -----------------------------------------------
 *	Default value: ---
 *	Read/write register
 *
 *	State program 2 interrupt MNG - SM2 control register.
 *
 *		bit:
 *			7:HYST2_2		HYST2_2:HYST0_2 Hysteresis unsigned value to be added
 *							or subtracted from threshold value in SM2.
 *			6:HYST1_2
 *			5:HYST0_2
 *				Default value: 000
 *			4:-
 *			3:SM2_PIN
 *				Default value: 0
 *				0: SM2 interrupt routed to INT1
 *				1: SM2 interrupt routed to INT1 pin.
 *			2:-
 *			1:-
 *			0:SM2_EN
 *				Default value: 0
 *				0: SM2 disabled
 *				1: SM2 enabled
 */
#define LIS3DSH_CTRL_REG2_ADDR				(uint8_t)0x22
#define _LIS3DSH_HYST2_2		7
#define _LIS3DSH_HYST1_2		6
#define _LIS3DSH_HYST0_2		5
#define _LIS3DSH_SM2_PIN		3
#define _LIS3DSH_SM2_EN			0

