giovadifiore/iot-home-automation/Client/src/helpers/include/stm32f4xx_helper_lis3dsh.h
/*	Registers ST2_1-ST2_16 ---- SM2 code registers [1-16] ------------------------------------------
 *	Default value: ---
 *	Write only registers
 *
 *	State machine 2 system register is made up of 16 8-bit registers,
 *	to implement 16-step op-code.
 */
#define LIS3DSH_ST2_1_ADDR					(uint8_t)0x60
#define LIS3DSH_ST2_2_ADDR					(uint8_t)0x61
#define LIS3DSH_ST2_3_ADDR					(uint8_t)0x62
#define LIS3DSH_ST2_4_ADDR					(uint8_t)0x63
#define LIS3DSH_ST2_5_ADDR					(uint8_t)0x64
#define LIS3DSH_ST2_6_ADDR					(uint8_t)0x65
#define LIS3DSH_ST2_7_ADDR					(uint8_t)0x66
#define LIS3DSH_ST2_8_ADDR					(uint8_t)0x67
#define LIS3DSH_ST2_9_ADDR					(uint8_t)0x68
#define LIS3DSH_ST2_10_ADDR					(uint8_t)0x69
#define LIS3DSH_ST2_11_ADDR					(uint8_t)0x6a
#define LIS3DSH_ST2_12_ADDR					(uint8_t)0x6b
#define LIS3DSH_ST2_13_ADDR					(uint8_t)0x6c
#define LIS3DSH_ST2_14_ADDR					(uint8_t)0x6d
#define LIS3DSH_ST2_15_ADDR					(uint8_t)0x6e
#define LIS3DSH_ST2_16_ADDR					(uint8_t)0x6f

/*	Register TIM4_2 ----------- SM2 general timer --------------------------------------------------
 *	Default value: ---
 *	Write only register
 *
 *	8-bit general timer (unsigned value) for SM2 operation timing.
 */
#define LIS3DSH_TIM4_2_ADDR					(uint8_t)0x70

/*	Register TIM3_2 ----------- SM2 general timer --------------------------------------------------
 *	Default value: ---
 *	Write only register
 *
 *	8-bit general timer (unsigned value) for SM2 operation timing.
 */
#define LIS3DSH_TIM3_2_ADDR					(uint8_t)0x71

/*	Register TIM2_2 ----------- SM2 general timer --------------------------------------------------
 *	Default value: ---
 *	Write only register
 *
 *	16-bit general timer (unsigned value) for SM2 operation timing.
 */
#define LIS3DSH_TIM2_2_L_ADDR				(uint8_t)0x72
#define LIS3DSH_TIM2_2_H_ADDR				(uint8_t)0x73

/*	Register TIM1_2 ----------- SM2 general timer --------------------------------------------------
 *	Default value: ---
 *	Write only register
 *
 *	16-bit general timer (unsigned value) for SM2 operation timing.
 */
#define LIS3DSH_TIM1_2_L_ADDR				(uint8_t)0x74
#define LIS3DSH_TIM1_2_H_ADDR				(uint8_t)0x75

/*	Register THRS2_2 ---------- SM2 threshold value 1 ----------------------------------------------
 *	Default value: ---
 *	Write only register
 *
 *	Threshold signed value for SM2 operation.
 */
#define LIS3DSH_THRS2_2_ADDR				(uint8_t)0x76

/*	Register THRS1_2 ---------- SM2 threshold value 2 ----------------------------------------------
 *	Default value: ---
 *	Write only register
 *
 *	Threshold signed value for SM2 operation.
 */
#define LIS3DSH_THRS1_2_ADDR				(uint8_t)0x77

/*Register MASK2_B ------------ SM2 axis and sign mask ---------------------------------------------
 *	Default value: ---
 *	Write only register
 *
 *	Axis and sign mask (swap) for SM2 motion detection operation.
 *
 *		bit:
 *			7:P_X
 *				0: X + disabled
 *				1: X + enabled
 *			6:N_X
 *				0: X - disabled
 *				1: X � enabled
 *			5:P_Y
 *				0: X + disabled
 *				1: X + enabled
 *			4:N_Y
 *				0: X - disabled
 *				1: X � enabled
 *			3:P_Z
 *				0: X + disabled
 *				1: X + enabled
 *			2:N_Z
 *				0: X - disabled
 *				1: X � enabled
 *			1:P_V
 *				0: X + disabled
 *				1: X + enabled
 *			0:N_V
 *				0: X - disabled
 *				1: X � enabled
 */
#define LIS3DSH_MASK2_B_ADDR				(uint8_t)0x79
#define _LIS3DSH_P_X		7
#define _LIS3DSH_N_X		6
#define _LIS3DSH_P_Y		5
#define _LIS3DSH_N_Y		4
#define _LIS3DSH_P_Z		3
#define _LIS3DSH_N_Z		2
#define _LIS3DSH_P_V		1
#define _LIS3DSH_N_V		0

/*	Register MASK2_A ---------- SM2 axis and sign mask ---------------------------------------------
 *	Default value: ---
 *	Write only register
 *
 *	Axis and sign mask (default) for SM2 motion detection operation.
 *
 *		bit:
 *			7:P_X
 *				0: X + disabled
 *				1: X + enabled
 *			6:N_X
 *				0: X - disabled
 *				1: X � enabled
 *			5:P_Y
 *				0: X + disabled
 *				1: X + enabled
 *			4:N_Y
 *				0: X - disabled
 *				1: X � enabled
 *			3:P_Z
 *				0: X + disabled
 *				1: X + enabled
 *			2:N_Z
 *				0: X - disabled
 *				1: X � enabled
 *			1:P_V
 *				0: X + disabled
 *				1: X + enabled
 *			0:N_V
 *				0: X - disabled
 *				1: X � enabled
 */
#define LIS3DSH_MASK2_A_ADDR				(uint8_t)0x7a
#define _LIS3DSH_P_X		7
#define _LIS3DSH_N_X		6
#define _LIS3DSH_P_Y		5
#define _LIS3DSH_N_Y		4
#define _LIS3DSH_P_Z		3
#define _LIS3DSH_N_Z		2
#define _LIS3DSH_P_V		1
#define _LIS3DSH_N_V		0

/*	Register SETT2 ------------ SM2 detection settings ---------------------------------------------
 *	Default value: ---
 *	Write only register
 *
 *	Setting of threshold, peak detection and flags for SM2 motion detection operation.
 *
 *		bit:
 *			7:P_DET			SM2 peak detection
 *				Default value: 0
 *				0: peak detection disabled
 *				1: peak detection enabled
 *			6:THR3_SA
 *				Default value: 0
 *				0: no action
 *				1: threshold 3 limit value for axis and sign mask reset (MASK2_B)
 *			5:ABS
 *				Default value: 0
 *				0: unsigned thresholds
 *				1: signed thresholds
 *			4:-
 *			3:-
 *			2:THR3_MA
 *				Default value: 0
 *				0: no action
 *				1: threshold 3 limit value for axis and sign mask reset (MASK2_A)
 *			1:RTAM			Next condition validation flag
 *				Default value: 0
 *				0: no valid next condition found
 *				1: valid next condition found and reset
 *			0:SITR
 *				Default value: 0
 *				0: no actions
 *				1: program flow can be modified by STOP and CONT commands
 */
#define LIS3DSH_SETT2_ADDR					(uint8_t)0x7b
#define _LIS3DSH_P_DET		7
#define _LIS3DSH_THR3_SA	6
#define _LIS3DSH_ABS		5
#define _LIS3DSH_THR3_MA	2
#define _LIS3DSH_RTAM		1
#define _LIS3DSH_SITR		0

/*	Register PR2 -------------- Program-reset pointer ----------------------------------------------
 *	Default value: ---
 *	Read only register
 *
 *	Program and reset pointer for SM2 motion detection operation.
 *
 *		bit:
 *			7:PP3		PP[3:0] SM2 program pointer address
 *			6:PP2
 *			5:PP1
 *			4:PP0
 *			3:PR3		PR[3:0] SM2 reset pointer address
 *			2:PR2
 *			1:PR1
 *			0:PR0
 */
#define LIS3DSH_RP2_ADDR					(uint8_t)0x7c
#define _LIS3DSH_PP3		7
#define _LIS3DSH_PP2		6
#define _LIS3DSH_PP1		5
#define _LIS3DSH_PP0		4
#define _LIS3DSH_PR3		3
#define _LIS3DSH_PR2		2
#define _LIS3DSH_PR1		1
#define _LIS3DSH_PR0		0

/*	Register TC2 -------------- Timer counter ------------------------------------------------------
 *	Default value: ---
 *	Read only registers
 *
 *	16-bit general timer (unsigned output value) for SM2 operation timing.
 */
#define LIS3DSH_TC2_L_ADDR					(uint8_t)0x7d
#define LIS3DSH_TC2_H_ADDR					(uint8_t)0x7e

/*	Register OUTS2 ------------ Main set flag ------------------------------------------------------
 *	Default value: ---
 *	Read only register
 *
 *	Output flags on axis for interrupt SM2 management.
 *
 *		bit:
 *			7:P_X
 *				0: X + no show
 *				1: X + show
 *			6:N_X
 *				0: X - no show
 *				1: X - show
 *			5:P_Y
 *				0: X + no show
 *				1: X + show
 *			4:N_Y
 *				0: X - no show
 *				1: X - show
 *			3:P_Z
 *				0: X + no show
 *				1: X + show
 *			2:N_Z
 *				0: X - no show
 *				1: X - show
 *			1:P_V
 *				0: X + no show
 *				1: X + show
 *			0:N_V
 *				0: X - no show
 *				1: X - show
 */
#define LIS3DSH_OUTS2_ADDR					(uint8_t)0x7f
#define _LIS3DSH_P_X		7
#define _LIS3DSH_N_X		6
#define _LIS3DSH_P_Y		5
#define _LIS3DSH_N_Y		4
#define _LIS3DSH_P_Z		3
#define _LIS3DSH_N_Z		2
#define _LIS3DSH_P_V		1
#define _LIS3DSH_N_V		0

/*	Register PEAK2 ------------ Peak value ---------------------------------------------------------
 *	Default value: ---
 *	Read only register
 *
 *	Peak detection value register for SM2 operation.
 */
#define LIS3DSH_PEAK2_ADDR					(uint8_t)0x1a

