giovadifiore/iot-home-automation/Client/src/helpers/include/stm32f4xx_helper_lis3dsh.h
/*	Register DES2 ------------- Decimation factor --------------------------------------------------
 *	Default value: ---
 *	Write only register
 *
 *	Decimation counter value register for SM2 operation.
 */
#define LIS3DSH_DES2_ADDR					(uint8_t)0x78

/**
 * Internal register type
 */
typedef uint8_t LIS3DSH_Register;

//-------------------------- structures ----------------------------------------------
/* Output data rate */
typedef enum {
	ODR_POWER_DOWN = LIS3DSH_ODR_POWER_DOWN,
	ODR_3_125_HZ = LIS3DSH_ODR_3_125_HZ,
	ODR_6_25_HZ = LIS3DSH_ODR_6_25_HZ,
	ODR_12_5_HZ = LIS3DSH_ODR_12_5_HZ,
	ODR_25_HZ = LIS3DSH_ODR_25_HZ,
	ODR_50_HZ = LIS3DSH_ODR_50_HZ,
	ODR_100_HZ = LIS3DSH_ODR_100_HZ,
	ODR_400_HZ = LIS3DSH_ODR_400_HZ,
	ODR_800_HZ = LIS3DSH_ODR_800_HZ,
	ODR_1600_HZ = LIS3DSH_ODR_1600_HZ

} LIS3DSH_OutputDataRateTypeDef;

/* Block Data Update Mode */
typedef enum {
	BDU_CONTINUOS = LIS3DSH_BDU_CONTINOUS_UPDATE,
	BDU_NOT_CONTINUOS = LIS3DSH_BDU_NOT_UPDATET

} LIS3DSH_BlockDataUpdateTypeDef;

/* Axis Enable */ //TODO
typedef enum {
	XYZ = LIS3DSH_XYZ_ENABLE,
} LIS3DSH_AxisEnableTypeDef;

/* Full scale mode */
typedef enum {
	FS_DEFAUTL = LIS3DSH_FS_2G,
	FS_2G = LIS3DSH_FS_2G,
	FS_4G = LIS3DSH_FS_4G,
	FS_6G = LIS3DSH_FS_6G,
	FS_8G = LIS3DSH_FS_8G,
	FS_16G = LIS3DSH_FS_16G,

} LIS3DSH_FullScaleModeTypeDef;

/* Configuration struct */
typedef struct {
	LIS3DSH_OutputDataRateTypeDef OutputDataRate;
	LIS3DSH_AxisEnableTypeDef Axes_Enable;
	LIS3DSH_BlockDataUpdateTypeDef BlockDataUpdate;
	LIS3DSH_FullScaleModeTypeDef FullScale;
} LIS3DSH_InitTypeDef;

/* Output struct */
typedef struct {
	short x; // 16 bit
	short y; // 16 bit
	short z; // 16 bit
} LIS3DSH_AxesOutputTypeDef;

/* Maximum Timeout values for flags waiting loops. These timeouts are not based
 * on accurate values, they just guarantee that the application will not remain
 * stuck if the SPI communication is corrupted.
 * You may modify these timeout values depending on CPU frequency and application
 * conditions (interrupts routines ...).
 */
#define LIS3DSH_FLAG_TIMEOUT         ((uint32_t)0x1000)

//-------------------------- LIS32DSH SPI defines -------------------------------------------------
/*
 * LIS3DSH uses SPI to communicate, in this case the SPI1 of the board.
 */
#define LIS3DSH_SPI							SPI1
/* SPI port */
#define LIS3DSH_SPI_GPIO_PORT				GPIOA
/* Clock for the SPI port A for MOSI,MISO,SCLK*/
#define LIS3DSH_SPI_GPIO_CLK_ENABLE()		__HAL_RCC_GPIOA_CLK_ENABLE()
#define LIS3DSH_SPI_GPIO_CLK_DISABLE()		__HAL_RCC_GPIOA_CLK_DISABLE()
/* Clock for the SPI periheral */
#define LIS3DSH_SPI_CLK_ENABLE()			__HAL_RCC_SPI1_CLK_ENABLE()
#define LIS3DSH_SPI_CLK_DISABLE()			__HAL_RCC_SPI1_CLK_DISABLE()
/* SPI alternate function */
#define LIS3DSH_SPI_AF						GPIO_AF5_SPI1

/* Source clock pin */
#define LIS3DSH_SPI_SCK_PIN					GPIO_PIN_5					// PA.05
#define LIS3DSH_SPI_SCK_GPIO_PORT			LIS3DSH_SPI_GPIO_PORT						// GPIOA
#define LIS3DSH_SPI_SCK_GPIO_CLK_ENABLE()	LIS3DSH_SPI_GPIO_CLK_ENABLE()
#define LIS3DSH_SPI_SCK_GPIO_CLK_DISABLE()  LIS3DSH_SPI_GPIO_CLK_DISABLE()
#define LIS3DSH_SPI_SCK_AF					LIS3DSH_SPI_AF

/* MISO pin */
#define LIS3DSH_SPI_MISO_PIN				GPIO_PIN_6					// PA.06
#define LIS3DSH_SPI_MISO_GPIO_PORT			LIS3DSH_SPI_GPIO_PORT						// GPIOA
#define LIS3DSH_SPI_MISO_GPIO_CLK_ENABLE()	LIS3DSH_SPI_GPIO_CLK_ENABLE()
#define LIS3DSH_SPI_MISO_GPIO_CLK_DISABLE() LIS3DSH_SPI_GPIO_CLK_DISABLE()
#define LIS3DSH_SPI_MISO_AF					LIS3DSH_SPI_AF

/* MOSI pin */
#define LIS3DSH_SPI_MOSI_PIN				GPIO_PIN_7					// PA.07
#define LIS3DSH_SPI_MOSI_GPIO_PORT			LIS3DSH_SPI_GPIO_PORT						// GPIOA
#define LIS3DSH_SPI_MOSI_GPIO_CLK_ENABLE()	LIS3DSH_SPI_GPIO_CLK_ENABLE()
#define LIS3DSH_SPI_MOSI_GPIO_CLK_DISABLE() LIS3DSH_SPI_GPIO_CLK_DISABLE()
#define LIS3DSH_SPI_MOSI_AF					LIS3DSH_SPI_AF

/* Chip Select Pin */
#define LIS3DSH_SPI_CS_PIN					GPIO_PIN_3					// PE.03
#define LIS3DSH_SPI_CS_GPIO_PORT			GPIOE						// GPIOE
#define LIS3DSH_SPI_CS_GPIO_CLK_ENABLE()    __HAL_RCC_GPIOE_CLK_ENABLE()
#define LIS3DSH_SPI_CS_GPIO_CLK_DISABLE()   __HAL_RCC_GPIOE_CLK_DISABLE()

//-------------------------- LIS32DSH Interrupt defines -------------------------------------------------
// TODO
/* Interrupt pin 1*/
#define LIS3DSH_SPI_INT1_PIN				GPIO_PIN_0					// PE.00
#define LIS3DSH_SPI_INT1_GPIO_PORT			GPIOE						// GPIOE
#define LIS3DSH_SPI_INT1_GPIO_CLK			RCC_AHB1Periph_GPIOE
#define LIS3DSH_SPI_INT1_EXTI_LINE			EXTI_Line0
#define LIS3DSH_SPI_INT1_EXTI_PORT_SOURCE	EXTI_PortSourceGPIOE
#define LIS3DSH_SPI_INT1_EXTI_PIN_SOURCE	EXTI_PinSource0
#define LIS3DSH_SPI_INT1_EXTI_IRQn			EXTI0_IRQn

/* Interrupt pin 2*/
#define LIS3DSH_SPI_INT2_PIN				GPIO_PIN_1					// PE.01
#define LIS3DSH_SPI_INT2_GPIO_PORT			GPIOE						// GPIOE
#define LIS3DSH_SPI_INT2_GPIO_CLK			RCC_AHB1Periph_GPIOE
#define LIS3DSH_SPI_INT2_EXTI_LINE			EXTI_Line1
#define LIS3DSH_SPI_INT2_EXTI_PORT_SOURCE	EXTI_PortSourceGPIOE
#define LIS3DSH_SPI_INT2_EXTI_PIN_SOURCE	EXTI_PinSource1
#define LIS3DSH_SPI_INT2_EXTI_IRQn			EXTI1_IRQn

/**************************************************************************************************
 * Registers marked as �Reserved� must not be changed. The writing to those registers may		  *
 * cause permanent damages to the device. The content of the registers that are loaded 			  *
 * at boot should not be changed. They contain the factory calibration values. 					  *
 * Their content is automatically restored when the device is powered up.						  *
 **************************************************************************************************/

/* Chip Select macro definition */
#define LIS3DSH_CS_LOW()       HAL_GPIO_WritePin(LIS3DSH_SPI_CS_GPIO_PORT, LIS3DSH_SPI_CS_PIN, GPIO_PIN_RESET)
#define LIS3DSH_CS_HIGH()      HAL_GPIO_WritePin(LIS3DSH_SPI_CS_GPIO_PORT, LIS3DSH_SPI_CS_PIN, GPIO_PIN_SET)

/* LIS3DSH functions */
void SPIx_LIS3DSH_Init();
void LIS3DSH_init(LIS3DSH_InitTypeDef);
void LIS3DSH_readAxes(LIS3DSH_AxesOutputTypeDef* axes);
void LIS3DSH_writeRegister(LIS3DSH_Register addr, uint8_t value);
void LIS3DSH_readRegister(LIS3DSH_Register addr, uint8_t* value);

//void lis3dsh_int1_enable();
//LIS3DSH_Register lis3dsh_read_register(LIS3DSH_Register addres);
//void lis3dsh_read_block(uint8_t* buf, uint8_t addres, uint16_t size);
//void lis3dsh_write_block(LIS3DSH_Register* buf, LIS3DSH_Register addres,
//		LIS3DSH_Register size);

//uint8_t lis3dsh_timeout_usercallback(void);

#endif /* STM32F4_DISCOVERY_LIS3DSH_H_ */
